{
	"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
	"createdDateTime":"2022-09-22T19:40:06.0733032Z",
	"creationSource":null,
	"description":"",
	"lastModifiedDateTime":"2023-04-26T08:03:48.3106057Z",
	"name":"Windows - Credential Provider Hardening",
	"platforms":"windows10",
	"priorityMetaData":null,
	"roleScopeTagIds":[
		"0"
	],
	"settingCount":4,
	"technologies":"mdm",
	"id":"28ef06c8-1cad-4f55-bdc6-9c2253e3f041",
	"templateReference":{
		"templateId":"",
		"templateFamily":"none",
		"templateDisplayName":null,
		"templateDisplayVersion":null
	},
	"settings":[
		{
			"id":"0",
			"settingInstance":{
				"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
				"settingDefinitionId":"device_vendor_msft_policy_config_admx_logon_blockuserfromshowingaccountdetailsonsignin",
				"settingInstanceTemplateReference":null,
				"choiceSettingValue":{
					"settingValueTemplateReference":null,
					"value":"device_vendor_msft_policy_config_admx_logon_blockuserfromshowingaccountdetailsonsignin_1",
					"children":[
						
					]
				}
			}
		},
		{
			"id":"1",
			"settingInstance":{
				"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
				"settingDefinitionId":"device_vendor_msft_policy_config_admx_credentialproviders_excludedcredentialproviders",
				"settingInstanceTemplateReference":null,
				"choiceSettingValue":{
					"settingValueTemplateReference":null,
					"value":"device_vendor_msft_policy_config_admx_credentialproviders_excludedcredentialproviders_1",
					"children":[
						{
							"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
							"settingDefinitionId":"device_vendor_msft_policy_config_admx_credentialproviders_excludedcredentialproviders_excludedcredentialproviders_message",
							"settingInstanceTemplateReference":null,
							"simpleSettingValue":{
								"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue",
								"settingValueTemplateReference":null,
								"value":"{60b78e88-ead8-445c-9cfd-0b87f74ea6cd}"
							}
						}
					]
				}
			}
		},
		{
			"id":"2",
			"settingInstance":{
				"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
				"settingDefinitionId":"device_vendor_msft_policy_config_windowslogon_disablelockscreenappnotifications",
				"settingInstanceTemplateReference":null,
				"choiceSettingValue":{
					"settingValueTemplateReference":null,
					"value":"device_vendor_msft_policy_config_windowslogon_disablelockscreenappnotifications_1",
					"children":[
						
					]
				}
			}
		},
		{
			"id":"3",
			"settingInstance":{
				"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
				"settingDefinitionId":"device_vendor_msft_policy_config_credentialproviders_blockpicturepassword",
				"settingInstanceTemplateReference":null,
				"choiceSettingValue":{
					"settingValueTemplateReference":null,
					"value":"device_vendor_msft_policy_config_credentialproviders_blockpicturepassword_1",
					"children":[
						
					]
				}
			}
		}
	]
}
